// Класс реализует метод ход
// Реализует представление карты
// 
// методы вызов хода
// создание карты
// изменение карты

// Вызов методов к.и. через вирт функц
// Создает игру - запускает к.и. и
// Определяет какой из игроков ходит

// карта создается явля игровыми объектом с к и
// представляет из себя граф
//

#ifndef ENGINE
#define ENGINE
// список игоровых объектов
// функция NextTurn : обход игровых объектов по списку и вызов метода NextTurnObj
// функция GameLoop : бесконечного игрового цикла


#endif 
